<a href="https://colab.research.google.com/github/19PA1A0205/Artificial-intelligence/blob/master/Ai_lab_Experiment_2_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Experiment 2
 
PANDAS
 
IMPORTING NEEDED PACKAGES

In [ ]:
import numpy as np
import pandas as pd

1)CREATING DATAFRAME MANUALLY

In [ ]:
data = {'Roll No':['205','210', '218'], 'Name':['Rajesh','Suma','Roshi']}
df = pd.DataFrame(data=data)
df

  Roll No    Name
0     205  Rajesh
1     210    Suma
2     218   Roshi

2)IMPORT DATA IN TO DATAFRAME

In [ ]:
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [ ]:
 df.isna().any()

Roll No                              False
Gender                               False
Section                              False
SSC Percentage                       False
inter_Diploma_percentage             False
B.Tech_percentage                    False
Backlogs                             False
placement status                     False
hostlers/days scholar                False
Rollno                                True
inter_Diploma_peecentage              True
registered_for_Placement_Training     True
hostler/day's scholar                 True
placement_status                      True
Urban/Rural                          False
dtype: bool

In [ ]:
df.shape

(116, 15)

In [ ]:
df.describe

<bound method NDFrame.describe of      Roll No Gender Section  ...  hostler/day's scholar  placement_status  Urban/Rural
0        1.0      M       A  ...                    NaN               NaN        Urban
1        2.0      F       A  ...                    NaN               NaN        Rural
2        3.0      F       A  ...                    NaN               NaN        Urban
3        5.0      M       A  ...                    NaN               NaN        Urban
4        6.0      M       A  ...                    NaN               NaN        Rural
..       ...    ...     ...  ...                    ...               ...          ...
111    113.0      M       B  ...                    NaN               NaN        Urban
112    114.0      M       B  ...                    NaN               NaN        Urban
113    115.0      M       B  ...                    NaN               NaN        Urban
114    116.0      M       B  ...                    NaN               NaN        Urban
115    117.0      M       B  ...                    NaN               NaN        Urban

[116 rows x 15 columns]>

3)ADDING,DELETING, MODIFYING ROWS AND COLUMNS IN DATAFRAME

3.1)
Adding a column

In [ ]:
host_day = pd.read_csv("hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [ ]:
df["hostlers/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostlers/days scholar
0        1      M  ...       Not placed                      d
1        2      F  ...           Placed                      d
2        3      F  ...       Not placed                      d
3        4      M  ...       Not placed                      d
4        5      M  ...       Not placed                      h

[5 rows x 10 columns]

 3.2)
DELETING A COLUMN

In [ ]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

 3.3)ADDING A ROW

In [ ]:
 df1 = pd.DataFrame({"Rollno":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_peecentage":[99],"B.Tech_percentage":[75],"Backlogs":[0],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostler"],"placement_status":["Not placed"]})
df1

   Rollno Gender  ... hostler/day's scholar  placement_status
0     118      F  ...               hostler        Not placed

[1 rows x 10 columns]

In [ ]:
df = df.append(df1)
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
3      4.0      M  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

3.4)Deleting a row

In [ ]:
 df=df.drop(3)
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

3.5)Modifying elements

In [ ]:
 df.loc[1,"hostlers/days scholar"] = "hostler"
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

4)APPLYING FUNCTIONS ON DATAFRAMES

In [ ]:
 def gracep(x):
  if (x<70):
     return (x+0.05)
  else:
     return (x)

In [ ]:
 df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(gracep)
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

5)ITERATIONS ON DATAFRAMES

In [ ]:
 for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
   print(rows["Roll No"]),"-",(rows["B.Tech_percentage"])

18.0
60.0
71.0
97.0
102.0

6) ACCESSING ELEMENTS FROM DATAFRAMES

In [ ]:
 df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

 7)DIFFERENT WAYS TO DEAL WITH NA's IN DATAFRAME

In [ ]:
 df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

 8.GROUP BY OPERATIONS ON DATAFRAMES

In [ ]:
group = df.groupby("Gender")
group["B.Tech_percentage"].agg(np.mean)

Gender
F    71.216735
M    57.343881
Name: B.Tech_percentage, dtype: float64

9)MERGING THE DATAFRAMES

In [ ]:
 df2 = pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [ ]:
df = pd.merge(df,df2,on = "Roll No")
df.head()

   Roll No Gender Section  ...  Urban/Rural_x  Urban/Rural_y  Urban/Rural
0      1.0      M       A  ...          Urban          Urban        Urban
1      2.0      F       A  ...          Rural          Rural        Rural
2      3.0      F       A  ...          Urban          Urban        Urban
3      5.0      M       A  ...          Urban          Urban        Urban
4      6.0      M       A  ...          Rural          Rural        Rural

[5 rows x 17 columns]

***THE END***